data = {
    'IT': {
        '1. Компьютер, подключенный к Internet, обязательно имеет: (..-адрес)': 'IP',
        '2. Для передачи в сети web-страниц используется протокол:': 'HTTP',
        '3. Как называется программа файловый менеджер, входящая в состав операционной среды Windows?': 'Проводник'
    },
    'История': {
        '1. Кто первым правил на Руси?': 'Рюрик',
        '2. В каком году началась вторая мировая война?': '1939',
        '3. При каком императоре Россия имела наибольшую по площади территорию?(Назовите только его/её имя)':
            'Александр'

    }
}

questions = {
    'Автомобили': {
        '1. В какой стране была создана автомобильная компания «Феррари»?': 'Италия',
        '2. Какая категория водительского удостоверения дает право работать водителем автобуса?': 'D',
        '3. Эта машина подняла репутацию автомобильной промышленности СССР. Интерес к ней оказался настолько '
        'высоким, что она продавалась за рубежом.': 'Победа'
    },
    'Природа': {
        '1. Сколько ног у паука?': '8',
        '2. Назовите самое умное животное среди морских животных.': 'Дельфин',
        '3. Назовите самое быстрое животное на нашей планете.': 'Гепард',
        '4. Какое дерево является самым высоким в мире?': "Эвкалипт",
        '5. Назовите самое крупное млекопитающее на земле(одно слово)': "Кит"
    }
}

questions_success = dict()

materials = {
    'Автомобили': 'https://liketest.ru/raznoe/viktorina-na-temu-avtomobili-s-otvetami.html',
    'Природа': 'https://liketest.ru/biologiya/viktorina-s-otvetami-znatoki-prirody.html',
    'IT': 'https://testua.ru/informatsionnye-tekhnologii/348-testy-po-informatsionnym-tekhnologiyam.html',
    'История': 'https://testua.ru/vsemirnaya-istoriya/957-testy-po-istorii-rossii-s-otvetami.html'
}

users = {}
